ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes extendedConfigurationObject="e7d6af32-9bc6-40c2-b3f1-f5d16ad67df9">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовить</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СборкаТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура vs_ОбработкаПроведения(Отказ, РежимПроведения)
	//Набор = Движения.vs_Доизготовление;
	//для Каждого  стр из vs_Доизготовить цикл
	//	Если  стр.Количество  > 0 тогда
	//		стрДвижения = набор.добавитьПриход();
	//		стрДвижения.Период = Дата;
	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	//		стрДвижения.Номенклатура = стр.Номенклатура;
	//		стрДвижения.Доизготовить = стр.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	//набор.записывать = Истина;
	//Набор.Записать();
	//
	//Набор = Движения.ИТБК_Доизготовление;
	//для Каждого  стр из vs_Доизготовить цикл
	//	Если  стр.Количество  > 0 тогда
	//		стрДвижения = набор.добавитьПриход();
	//		стрДвижения.Период = Дата;
	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	//		стрДвижения.Номенклатура = стр.Номенклатура;
	//		стрДвижения.Доизготовить = стр.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	//набор.записывать = Истина;
	//Набор.Записать();
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
		Отказ = vs_ОбщийМодуль.ЕстьДоизготовления(vs_АктИзготовления);
	КонецЕсли;
	// begin fix Designer29.09.2023 10:26:08
	Если Не Отказ и Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Дата = КонецДня(Дата) Тогда
			Дата = Дата - 60*60+1;
		КонецЕсли;
		// begin fix Designer 2025.12.21
		Т = "
		|ВЫБРАТЬ
	    |	ЦеныНоменклатуры.Цена КАК ПлановаяСтоимость,
	    |	ЦеныНоменклатуры.Цена * &Количество КАК СуммаПлановая
	    |ИЗ
	    |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	    |			&ДатаЦены,
	    |			ВидЦены = &ВидЦены
	    |				И Номенклатура = &Номенклатура
	    |				И Характеристика = &Характеристика) КАК ЦеныНоменклатуры";
		Запрос = Новый Запрос(Т);
		Запрос.УстановитьПараметр("ДатаЦены", Новый Граница(Дата, Видграницы.Включая));
		//Справочники.ВидыЦен.НайтиПоНаименованию("");
		Запрос.УстановитьПараметр("ВидЦены", Новый СправочникСсылка.ВидыЦен(Новый УникальныйИдентификатор("27e7634d-71dc-11eb-ab40-00155d439817")));
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Количество", Количество);
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда
			Выб = Рез.Выбрать();
			Если Выб.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выб);
			КонецЕсли;
		КонецЕсли;
		// end fix Designer 2025.12.21
	КонецЕсли;	
КонецПроцедуры

&После("ПередЗаписью")
Процедура vs_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	//никитина 28.09.20
	//заполним серию
	СтрокаСерии = Серии.Найти(Номенклатура,"Номенклатура");
	Если СтрокаСерии <> Неопределено тогда
		ИТБК_Серия = СтрокаСерии.Серия;	
	иначе
		ИТБК_Серия = Серия
	КонецЕсли;

КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура vs_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ИТБК_Серия");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецЕсли
